bench/results/20260917T203432Z-cursor-scaled20/raw/light/http/c/round3/c200.wrk.txt
Running 30s test @ http://127.0.0.1:18300/
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms  527.15us   5.06ms   84.34%
    Req/Sec    39.21k     1.36k   42.50k    71.24%
  Latency Distribution
     50%    0.92ms
     75%    1.20ms
     90%    1.49ms
     99%    3.44ms
  1171110 requests in 30.01s, 318.30MB read
Requests/sec:  39022.58
Transfer/sec:     10.61MB